[NoCoverage] BlockStatement
src/app/app.component.ts:18:20
 
   classNameTitle: string = 'my_title';
 
-  ngOnInit(): void {
-    console.log(this.initConsole);
-  }
+  ngOnInit(): void {}
 
   initConsole: string = 'Iniciou o AppComponent!!';

[NoCoverage] StringLiteral
src/app/app.component.ts:22:25
     console.log(this.initConsole);
   }
 
-  initConsole: string = 'Iniciou o AppComponent!!';
+  initConsole: string = "";
 }
 
