[Survived] BooleanLiteral
src/app/data-binding/data-binding.component.ts:11:35
 export class DataBindingComponent {
   public nome: string = 'abc';
   public idade: number = 20;
-  public checkDisabled: boolean = false;
+  public checkDisabled: boolean = true;
   public urlImagem: string =
     'https://logowik.com/content/uploads/images/angular9826.logowik.com.webp';

[Survived] StringLiteral
src/app/data-binding/data-binding.component.ts:14:29
   public checkDisabled: boolean = false;
   public urlImagem: string =
     'https://logowik.com/content/uploads/images/angular9826.logowik.com.webp';
-  public imgTitle: string = 'Imagem Angular';
+  public imgTitle: string = "";
   public position: { x: number; y: number } = { x: 0, y: 0 };
   public randomData: number = Math.random();

[Survived] BlockStatement
src/app/data-binding/data-binding.component.ts:18:17
   public position: { x: number; y: number } = { x: 0, y: 0 };
   public randomData: number = Math.random();
 
-  constructor() {
-    console.log(this.randomData);
-  }
+  constructor() {}
 
   public alertaInfo(valor: MouseEvent): void {

[NoCoverage] BlockStatement
src/app/data-binding/data-binding.component.ts:22:46
     console.log(this.randomData);
   }
 
-  public alertaInfo(valor: MouseEvent): void {
-    console.log(valor);
-  }
+  public alertaInfo(valor: MouseEvent): void {}
 
   public mouseMoveTest(valor: MouseEvent): void {

[NoCoverage] BlockStatement
src/app/data-binding/data-binding.component.ts:26:49
     console.log(valor);
   }
 
-  public mouseMoveTest(valor: MouseEvent): void {
-    this.position.x = valor.offsetX;
-    this.position.y = valor.offsetY;
-  }
+  public mouseMoveTest(valor: MouseEvent): void {}
 }
 
